/*
 * @Author: zhanghongqiao 
 * @Date: 2018-11-13 09:08:16 
 * @Email: 991034150@qq.com 
 * @Description: 地区列表选择
 * @Last Modified by: zhanghongqiao
 * @Last Modified time: 2018-11-13 09:21:21
 */


export default {
  url: '/areaList',
  // enableMock: true, // 是否使用本地假数据
  mock: {
    "erroCode": 2000,
    "erroMsg": null,
    "result": {
      "110105":{
        "110105001":"东三环中路",
        "110105002":"东三环北路"
      },
      "210000":{
        "210100":"沈阳市"
      },
      "110102":{
        "110105003":"阜成门南大街",
        "110102001":"太平桥大街"
      },
      "110000":{
        "110100":"北京市"
      },
      "110100":{
        "110105":"朝阳区",
        "110102":"西城区",
        "110108":"海淀区"
      },
      "110108":{
        "110108001":"学院路38号 "
      },
      "0":[
        {
          "address":"北京",
          "id":110000
        },
        {
          "address":"辽宁省",
          "id":210000
        }
      ],
      "110108001":{
        "51":"公共卫生学院"
      },
      "110105001":{
        "10":"环球金融中心东楼"
      },
      "110105002":{
        "11":"京信大厦1",
        "13":"京信大厦2",
        "14":"京信大厦3"
      },
      "210102001":{
        "43":"沈阳东北大学酒店"
      },
      "110105003":{
        "15":"1号楼"
      },
      "210102":{
        "210102001":"文体西路80号"
      },
      "110102001":{
        "12":"政协办公楼"
      },
      "210100":{
        "210102":"和平区"
      }
    }
  }
}